InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Comment>Поле в котором хранится числовое значение телефонного номера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Полученное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправленное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сохраненное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПисьмоПоставщикуПоЗаказу/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Письмо поставщику по заказу.
//
// Формирует текст запроса поставщику по заказу (шины), кладёт его в буфер
// обмена и открывает форму нового электронного письма. Ничего не отправляет:
// отправку делает менеджер из открытого окна.
//
// Точки входа для кнопок форм заказов:
//     ПисьмоПоставщикуПоЗаказу.ОткрытьПисьмоПоЗаказу(Ссылка);          - заказ поставщику
//     ПисьмоПоставщикуПоЗаказу.ОткрытьПисьмоПоДокументу(Ссылка);       - заказ покупателя,
//                                                                        приём на хранение
//     ПисьмоПоставщикуПоЗаказу.ОткрытьПисьмоПоставщикуПоПредЗаказу(Ссылка); - предзаказ:
//                                                        подтверждение наличия и реквизиты
//
////////////////////////////////////////////////////////////////////////////////

// Основная процедура: текст письма -> буфер обмена -> открытая форма письма.
//
// Параметры
//  ЗаказСсылка - ДокументСсылка.ЗаказПоставщику
//
Процедура ОткрытьПисьмоПоЗаказу(ЗаказСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗаказСсылка) Тогда
		Сообщить("Заказ не записан — письмо формировать не по чему.");
		Возврат;
	КонецЕсли;
	
	Заказ = ЗаказСсылка.ПолучитьОбъект();
	Если Заказ = Неопределено Тогда
		Сообщить("Не удалось прочитать заказ поставщику.");
		Возврат;
	КонецЕсли;
	
	ТекстПисьма = СформироватьТекстПисьма(Заказ);
	
	// Текст в буфер обмена — вдруг письмо будут отправлять из другой почты.
	Если ПоместитьВБуферОбмена(ТекстПисьма) Тогда
		Сообщить("Текст письма скопирован в буфер обмена.");
	КонецЕсли;
	
	Адреса = АдресаКонтрагента(Заказ.Контрагент);
	Если Адреса.Количество() = 0 Тогда
		Сообщить("Не заполнена почта поставщика: " + Строка(Заказ.Контрагент)
			+ ". Письмо открыто без получателя — адрес нужно вписать вручную.");
	КонецЕсли;
	
	СтруктураНовогоПисьма = Новый Структура;
	СтруктураНовогоПисьма.Вставить("Кому"     , Адреса);
	СтруктураНовогоПисьма.Вставить("Тема"     , ТемаПисьма(Заказ));
	СтруктураНовогоПисьма.Вставить("Тело"     , ТекстПисьма);
	СтруктураНовогоПисьма.Вставить("ВидТекста", Перечисления.ВидыТекстовЭлектронныхПисем.Текст);
	
	// Приём тот же, что у соседней кнопки «відправити платіжку» в форме заказа:
	// письмо создаётся БЕЗ открытия (последний параметр Ложь), тогда возвращается
	// сам объект письма — ему проставляется заказ, и только после этого
	// открывается форма. Иначе реквизит уже не записать.
	Результат = УправлениеЭлектроннойПочтой.НаписатьПисьмо(
		глЗначениеПеременной("глТекущийПользователь"), СтруктураНовогоПисьма, , , , , , Истина, Ложь);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		// Учётных записей для отправки нет (Неопределено) либо запись письма
		// не прошла (тогда вернулось описание ошибки строкой).
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			Сообщить("Не удалось создать письмо: " + Результат);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// Связь письма с заказом: при отправке письма модуль объекта ЭлектронноеПисьмо
	// сам проставит заказу БП_СтатусПисьма = Отправлено.
	Попытка
		Результат.Письмо.БП_ЗаказПоставщику = ЗаказСсылка;
	Исключение
		Сообщить("Не удалось связать письмо с заказом — статус отправки в заказе не обновится.");
	КонецПопытки;
	
	Попытка
		Результат.Форма.Открыть();
	Исключение
		Сообщить("Письмо создано, но форма не открылась: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Открывает пустое письмо по документу (заказ покупателя, приём на хранение),
// связав его с документом через реквизит ДокументОснование.
//
// Текст не заполняем — что писать клиенту, решает менеджер. Задача процедуры
// в другом: подставить адрес контрагента и связать письмо с документом, чтобы
// оно попало в структуру подчинённости (реквизит входит в критерий отбора
// «СвязанныеДокументы»).
//
// Параметры
//  ДокументСсылка - ДокументСсылка.ЗаказПокупателя, ДокументСсылка.ПриемТовараНаХранение
//
Процедура ОткрытьПисьмоПоДокументу(ДокументСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Сообщить("Документ не записан — письмо привязывать не к чему.");
		Возврат;
	КонецЕсли;
	
	Контрагент = Неопределено;
	Попытка
		Контрагент = ДокументСсылка.Контрагент;
	Исключение
		Контрагент = Неопределено;
	КонецПопытки;
	
	Адреса = АдресаКонтрагента(Контрагент);
	Если Адреса.Количество() = 0 Тогда
		Сообщить("Не заполнена почта контрагента: " + Строка(Контрагент)
			+ ". Письмо открыто без получателя — адрес нужно вписать вручную.");
	КонецЕсли;
	
	СтруктураНовогоПисьма = Новый Структура;
	СтруктураНовогоПисьма.Вставить("Кому", Адреса);
	СтруктураНовогоПисьма.Вставить("Тема", ТемаПисьмаПоДокументу(ДокументСсылка));
	
	// Письмо создаётся без открытия: только так можно проставить реквизит
	// до того, как форма показана.
	Результат = УправлениеЭлектроннойПочтой.НаписатьПисьмо(
		глЗначениеПеременной("глТекущийПользователь"), СтруктураНовогоПисьма, , , , , , Истина, Ложь);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			Сообщить("Не удалось создать письмо: " + Результат);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Попытка
		Результат.Письмо.ДокументОснование = ДокументСсылка;
	Исключение
		Сообщить("Не удалось связать письмо с документом — в структуре подчинённости его не будет.");
	КонецПопытки;
	
	Попытка
		Результат.Форма.Открыть();
	Исключение
		Сообщить("Письмо создано, но форма не открылась: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Открывает письмо поставщику по ПРЕДЗАКАЗУ: подтверждение наличия и запрос
// реквизитов на оплату.
//
// Поставщик берётся из строк табличной части «Товары» (реквизит Контрагент).
// Если поставщиков в предзаказе несколько, спрашиваем, по какому из них письмо,
// и в письмо попадают только его строки: у каждого своя поставка и свои реквизиты.
//
// Параметры
//  ПредЗаказСсылка - ДокументСсылка.ПредЗаказ
//
Процедура ОткрытьПисьмоПоставщикуПоПредЗаказу(ПредЗаказСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ПредЗаказСсылка) Тогда
		Сообщить("Передзамовлення не записане — лист формувати нема з чого.");
		Возврат;
	КонецЕсли;
	
	ПредЗаказ = ПредЗаказСсылка.ПолучитьОбъект();
	Если ПредЗаказ = Неопределено Тогда
		Сообщить("Не вдалося прочитати передзамовлення.");
		Возврат;
	КонецЕсли;
	
	Поставщики = ПоставщикиПредЗаказа(ПредЗаказ);
	
	Если Поставщики.Количество() = 0 Тогда
		Сообщить("У рядках товарів передзамовлення не вказано постачальника (колонка «Контрагент») — лист нема кому адресувати."
			+ " Якщо постачальник заповнений на екрані — запишіть документ: лист збирається з записаних даних.");
		Возврат;
	КонецЕсли;
	
	Поставщик = Поставщики[0].Значение;
	
	Если Поставщики.Количество() > 1 Тогда
		// ВыбратьЭлемент есть только на клиенте, а модуль компилируется и на сервере.
		#Если Клиент Тогда
		ЭлементСписка = Поставщики.ВыбратьЭлемент("Постачальник, якому пишемо листа");
		Если ЭлементСписка = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Поставщик = ЭлементСписка.Значение;
		#КонецЕсли
	КонецЕсли;
	
	ТекстПисьма = ТекстПисьмаПоПредЗаказу(ПредЗаказ, Поставщик);
	
	Если ПоместитьВБуферОбмена(ТекстПисьма) Тогда
		Сообщить("Текст листа скопійовано в буфер обміну.");
	КонецЕсли;
	
	Адреса = АдресаКонтрагента(Поставщик);
	Если Адреса.Количество() = 0 Тогда
		Сообщить("Не заповнена пошта постачальника: " + Строка(Поставщик)
			+ ". Лист відкрито без отримувача — адресу треба вписати вручну.");
	КонецЕсли;
	
	СтруктураНовогоПисьма = Новый Структура;
	СтруктураНовогоПисьма.Вставить("Кому"     , Адреса);
	СтруктураНовогоПисьма.Вставить("Тема"     , ТемаПисьмаПоПредЗаказу(ПредЗаказ));
	СтруктураНовогоПисьма.Вставить("Тело"     , ТекстПисьма);
	СтруктураНовогоПисьма.Вставить("ВидТекста", Перечисления.ВидыТекстовЭлектронныхПисем.Текст);
	
	Результат = УправлениеЭлектроннойПочтой.НаписатьПисьмо(
		глЗначениеПеременной("глТекущийПользователь"), СтруктураНовогоПисьма, , , , , , Истина, Ложь);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			Сообщить("Не вдалося створити лист: " + Результат);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Попытка
		Результат.Письмо.ДокументОснование = ПредЗаказСсылка;
	Исключение
		Сообщить("Не вдалося зв'язати лист з передзамовленням — у структурі підпорядкованості його не буде.");
	КонецПопытки;
	
	Попытка
		Результат.Форма.Открыть();
	Исключение
		Сообщить("Лист створено, але форма не відкрилася: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Тема письма поставщику: бренд и номер предзаказа — «GarazhUA 147700».
//
// Номер у предзаказа числовой, поэтому выводим без разделителя групп: иначе
// в теме оказывается «147 700», и поиск по номеру в почте не находит письмо.
//
Функция ТемаПисьмаПоПредЗаказу(ПредЗаказ) Экспорт
	
	Возврат БрендПодразделения(ПредЗаказ.Подразделение) + " " + Формат(ПредЗаказ.Номер, "ЧГ=0");
	
КонецФункции

// Бренд, от имени которого пишем. Определяем по подразделению документа:
// его наименование содержит бренд — «1. Відділ продажу (Garazh.UA)»,
// «6. Відділ продажу (ionity.tires)».
//
Функция БрендПодразделения(Подразделение) Экспорт
	
	Наименование = НРег(СокрЛП(Строка(Подразделение)));
	
	Если Найти(Наименование, "ionity") > 0 Тогда
		Возврат "Ionity.tires";
	КонецЕсли;
	
	Возврат "GarazhUA";
	
КонецФункции

// Список поставщиков, встречающихся в строках товаров предзаказа.
//
// В колонке Контрагент может стоять и склад (тип составной) — склады отсеиваем,
// письмо пишут контрагенту.
//
// Возвращаемое значение:
//  СписокЗначений
//
Функция ПоставщикиПредЗаказа(ПредЗаказ) Экспорт
	
	Поставщики = Новый СписокЗначений;
	
	Для Каждого СтрокаТовара Из ПредЗаказ.Товары Цикл
		
		Если ТипЗнч(СтрокаТовара.Контрагент) <> Тип("СправочникСсылка.Контрагенты")
			Или Не ЗначениеЗаполнено(СтрокаТовара.Контрагент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Поставщики.НайтиПоЗначению(СтрокаТовара.Контрагент) = Неопределено Тогда
			Поставщики.Добавить(СтрокаТовара.Контрагент, Строка(СтрокаТовара.Контрагент));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Поставщики;
	
КонецФункции

// Текст письма поставщику по предзаказу: позиции этого поставщика,
// подтверждение наличия, запрос реквизитов на оплату и данных для ТТН.
//
// Страна и год выпуска подставляются из строки, если заполнены; иначе остаётся
// место под ответ поставщика — это одна из вещей, которую у него и спрашивают.
//
// Параметры
//  ПредЗаказ  - ДокументОбъект.ПредЗаказ или ДокументСсылка.ПредЗаказ
//  Поставщик  - СправочникСсылка.Контрагенты
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстПисьмаПоПредЗаказу(ПредЗаказ, Поставщик) Экспорт
	
	Номер = 0;
	ИтогСумма = 0;
	Валюта = "";
	Позиции = "";
	
	Для Каждого СтрокаТовара Из ПредЗаказ.Товары Цикл
		
		Если СтрокаТовара.Контрагент <> Поставщик Тогда
			Продолжить;
		КонецЕсли;
		
		Номер = Номер + 1;
		ИтогСумма = ИтогСумма + СтрокаТовара.СуммаПокупки;
		
		// Валюта закупки заполнена примерно у трети строк, поэтому берём первую
		// непустую по этому поставщику, а если её нет вовсе — ниже подставим гривну.
		Если ПустаяСтрока(Валюта) И ЗначениеЗаполнено(СтрокаТовара.ВалютаПокупки) Тогда
			Валюта = СокрЛП(Строка(СтрокаТовара.ВалютаПокупки));
		КонецЕсли;
		
		// Валюта дописывается в конце: она может выясниться на второй строке,
		// когда первая уже собрана.
		Позиции = Позиции + Строка(Номер) + ". " + СокрЛП(Строка(СтрокаТовара.Номенклатура)) + Символы.ПС
			+ "   Країна і рік виготовлення: " + ПредставлениеСтраныИГода(СтрокаТовара) + Символы.ПС
			+ "   Кількість: " + ЧислоВСтроку(СтрокаТовара.Количество) + Символы.ПС
			+ "   Ціна за одиницю: " + ЧислоВСтроку(СтрокаТовара.ЦенаПокупки) + " [В]" + Символы.ПС
			+ "   Сума: " + ЧислоВСтроку(СтрокаТовара.СуммаПокупки) + " [В]" + Символы.ПС + Символы.ПС;
		
	КонецЦикла;
	
	Если ПустаяСтрока(Валюта) Тогда
		Валюта = "грн.";
	КонецЕсли;
	
	Если Номер = 0 Тогда
		Позиции = "(у передзамовленні немає рядків цього постачальника)" + Символы.ПС + Символы.ПС;
	КонецЕсли;
	
	Текст = "Доброго дня." + Символы.ПС
		+ "Замовлення по шинам:" + Символы.ПС + Символы.ПС
		+ СтрЗаменить(Позиции, "[В]", Валюта)
		+ "Сума замовлення: " + ЧислоВСтроку(ИтогСумма) + " " + Валюта + Символы.ПС + Символы.ПС
		+ "Просимо підтвердити наявність та надіслати реквізити для оплати." + Символы.ПС + Символы.ПС
		+ "*Якщо шини поставляються або відправляються з перебитою датою без попередження, всі витрати з приводу повернення товару, комісії при оплатах лягають на постачальника, а також претензії від клієнта переадресовуються на постачальника." + Символы.ПС + Символы.ПС
		+ "Вкажіть, будь ласка дані щодо відправки, для створення ТТН." + Символы.ПС + Символы.ПС
		+ "*Якщо шини треба забирати кур'єром Нової пошти за адресою - вкажіть будь ласка робочий графік коли кур'єр може приїхати." + Символы.ПС;
	
	Возврат Текст;
	
КонецФункции

// Страна и год выпуска строки предзаказа. Оба реквизита строковые и часто пусты:
// это как раз то, что уточняют у поставщика, поэтому вместо пустоты оставляем
// место под ответ.
//
Функция ПредставлениеСтраныИГода(СтрокаТовара)
	
	Страна = СокрЛП(СтрокаТовара.Страна);
	
	// Год хранится строкой и приезжает из формы с разделителем групп — "2 025".
	// В письме это читается как опечатка, поэтому пробелы (в том числе
	// неразрывный) убираем.
	Год = СокрЛП(СтрокаТовара.ДатаПроизводства);
	Год = СтрЗаменить(Год, Символ(160), "");
	Год = СтрЗаменить(Год, " ", "");
	
	Если ПустаяСтрока(Страна) И ПустаяСтрока(Год) Тогда
		Возврат "______________";
	КонецЕсли;
	
	Если ПустаяСтрока(Страна) Тогда
		Возврат Год;
	КонецЕсли;
	
	Если ПустаяСтрока(Год) Тогда
		Возврат Страна;
	КонецЕсли;
	
	Возврат Страна + ", " + Год;
	
КонецФункции

// Тема письма по документу: вид документа, номер и дата.
//
Функция ТемаПисьмаПоДокументу(ДокументСсылка) Экспорт
	
	Возврат СокрЛП(ДокументСсылка.Метаданные().Синоним) + " " + СокрЛП(ДокументСсылка.Номер)
		+ " від " + Формат(ДокументСсылка.Дата, "ДЛФ=D");
	
КонецФункции

// Тема письма.
//
Функция ТемаПисьма(Заказ) Экспорт
	
	Возврат "Замовлення " + СокрЛП(Заказ.Номер) + " від " + Формат(Заказ.Дата, "ДЛФ=D");
	
КонецФункции

// Текст письма по заказу. Ничего не пишет и не открывает — только строка,
// чтобы её можно было проверить отдельно от отправки.
//
// Параметры
//  Заказ - ДокументОбъект.ЗаказПоставщику или ДокументСсылка.ЗаказПоставщику
//
// Возвращаемое значение:
//  Строка
//
Функция СформироватьТекстПисьма(Заказ) Экспорт
	
	Валюта = СокрЛП(Строка(Заказ.ВалютаДокумента));
	
	Текст = "Доброго дня." + Символы.ПС
		+ "Замовлення по шинам:" + Символы.ПС + Символы.ПС;
	
	Номер = 0;
	ИтогСумма = 0;
	Для Каждого СтрокаТовара Из Заказ.Товары Цикл
		
		Номер = Номер + 1;
		ИтогСумма = ИтогСумма + СтрокаТовара.Сумма;
		
		Наименование = СокрЛП(Строка(СтрокаТовара.Номенклатура));
		Если ЗначениеЗаполнено(СтрокаТовара.ХарактеристикаНоменклатуры) Тогда
			Наименование = Наименование + ", " + СокрЛП(Строка(СтрокаТовара.ХарактеристикаНоменклатуры));
		КонецЕсли;
		
		Текст = Текст + Строка(Номер) + ". " + Наименование + Символы.ПС
			+ "   Країна і рік виготовлення: ______________" + Символы.ПС
			+ "   Кількість: " + ЧислоВСтроку(СтрокаТовара.Количество) + " " + СокрЛП(Строка(СтрокаТовара.ЕдиницаИзмерения)) + Символы.ПС
			+ "   Ціна за одиницю: " + ЧислоВСтроку(СтрокаТовара.Цена) + " " + Валюта + Символы.ПС
			+ "   Сума: " + ЧислоВСтроку(СтрокаТовара.Сумма) + " " + Валюта + Символы.ПС + Символы.ПС;
		
	КонецЦикла;
	
	Если Номер = 0 Тогда
		Текст = Текст + "(у замовленні немає жодного рядка товарів)" + Символы.ПС + Символы.ПС;
	КонецЕсли;
	
	Текст = Текст + "Сума замовлення: " + ЧислоВСтроку(ИтогСумма) + " " + Валюта + Символы.ПС + Символы.ПС
		+ "*Якщо шини поставляються або відправляються з перебитою датою без попередження, всі витрати з приводу повернення товару, комісії при оплатах лягають на постачальника, а також претензії від клієнта переадресовуються на постачальника." + Символы.ПС + Символы.ПС
		+ "Вкажіть, будь ласка дані щодо відправки, для створення ТТН." + Символы.ПС + Символы.ПС
		+ "*Якщо шини треба забирати кур'єром Нової пошти за адресою - вкажіть будь ласка робочий графік коли кур'єр може приїхати." + Символы.ПС;
	
	Возврат Текст;
	
КонецФункции

// Последнее письмо переписки с контрагентом по документу и связанным с ним заказам.
//
// Нужна, чтобы новое письмо (платёжка) ушло ответом в уже идущую переписку, а не
// отдельной веткой. Собирает письма из дерева документов: сам документ, его
// основание (заказ покупателя) и предзаказ этого заказа; к ним — письма,
// привязанные реквизитами БП_ЗаказПоставщику и ДокументОснование, и все ответы
// на них по цепочке ОснованиеПисьма. Из отправленных и полученных оставляет
// переписку с адресами контрагента и берёт самое свежее.
//
// Параметры
//  Документ - ДокументСсылка.ЗаказПоставщику или другой документ цепочки
//  Адреса   - СписокЗначений или Массив адресов контрагента; пустой — без отбора
//
// Возвращаемое значение:
//  ДокументСсылка.ЭлектронноеПисьмо — пустая ссылка, если переписки нет
//
Функция ПоследнееПисьмоПереписки(Документ, Адреса) Экспорт
	
	Результат = Документы.ЭлектронноеПисьмо.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Письма, привязанные к документам цепочки.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документы", ДокументыЦепочкиЗаказа(Документ));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭлектронноеПисьмо.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	|ГДЕ
	|	НЕ ЭлектронноеПисьмо.ПометкаУдаления
	|	И (ЭлектронноеПисьмо.БП_ЗаказПоставщику В (&Документы)
	|			ИЛИ ЭлектронноеПисьмо.ДокументОснование В (&Документы))";
	
	Письма = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	// Ответы на них, сколько бы уровней ни было. Ограничитель глубины — страховка
	// от зацикленных оснований, которые можно проставить руками.
	Слой    = Письма;
	Глубина = 0;
	Пока Слой.Количество() > 0 И Глубина < 30 Цикл
		
		Глубина = Глубина + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Письма", Слой);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронноеПисьмо.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
		|ГДЕ
		|	НЕ ЭлектронноеПисьмо.ПометкаУдаления
		|	И ЭлектронноеПисьмо.ОснованиеПисьма В (&Письма)";
		
		Новые = Новый Массив;
		Для Каждого Ответ Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка") Цикл
			Если Письма.Найти(Ответ) = Неопределено Тогда
				Письма.Добавить(Ответ);
				Новые.Добавить(Ответ);
			КонецЕсли;
		КонецЦикла;
		Слой = Новые;
		
	КонецЦикла;
	
	Если Письма.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	АдресаОтбора = Новый Соответствие;
	Для Каждого Элемент Из Адреса Цикл
		Значение = ?(ТипЗнч(Элемент) = Тип("ЭлементСпискаЗначений"), Элемент.Значение, Элемент);
		Если Не ПустаяСтрока(Значение) Тогда
			АдресаОтбора.Вставить(НРег(СокрЛП(Значение)), Истина);
		КонецЕсли;
	КонецЦикла;
	
	// Черновики и неотправленные не считаются: отвечать можно только на то, что
	// реально было в переписке. Дата — отправления, а если её нет — документа.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Письма", Письма);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭлектронноеПисьмо.Ссылка КАК Ссылка,
	|	ЭлектронноеПисьмо.СтатусПисьма КАК СтатусПисьма,
	|	ЭлектронноеПисьмо.ОтправительАдресЭлектроннойПочты КАК Отправитель,
	|	ВЫБОР
	|		КОГДА ЭлектронноеПисьмо.ДатаОтправления > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЭлектронноеПисьмо.ДатаОтправления
	|		ИНАЧЕ ЭлектронноеПисьмо.Дата
	|	КОНЕЦ КАК ДатаПисьма
	|ИЗ
	|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	|ГДЕ
	|	ЭлектронноеПисьмо.Ссылка В (&Письма)
	|	И ЭлектронноеПисьмо.СтатусПисьма В (ЗНАЧЕНИЕ(Перечисление.СтатусыПисем.Отправленное), ЗНАЧЕНИЕ(Перечисление.СтатусыПисем.Полученное))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПисьма УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если АдресаОтбора.Количество() = 0 Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
		Если Выборка.СтатусПисьма = Перечисления.СтатусыПисем.Полученное Тогда
			Если АдресаОтбора[НРег(СокрЛП(Выборка.Отправитель))] <> Неопределено Тогда
				Возврат Выборка.Ссылка;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаАдреса Из Выборка.Ссылка.КомуТЧ Цикл
			Если АдресаОтбора[НРег(СокрЛП(СтрокаАдреса.АдресЭлектроннойПочты))] <> Неопределено Тогда
				Возврат Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаАдреса Из Выборка.Ссылка.КопииТЧ Цикл
			Если АдресаОтбора[НРег(СокрЛП(СтрокаАдреса.АдресЭлектроннойПочты))] <> Неопределено Тогда
				Возврат Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Документы, по которым ищется переписка: сам документ и вверх по основаниям —
// заказ покупателя, из которого создан заказ поставщику, и предзаказ этого
// заказа. Ровно та цепочка, что видна в структуре подчинённости.
//
Функция ДокументыЦепочкиЗаказа(Документ)
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("ДокументОснование");
	Реквизиты.Добавить("ПредЗаказ");
	
	Цепочка = Новый Массив;
	Очередь = Новый Массив;
	Очередь.Добавить(Документ);
	
	Пока Очередь.Количество() > 0 И Цепочка.Количество() < 20 Цикл
		
		Текущий = Очередь[0];
		Очередь.Удалить(0);
		
		Если Не ЗначениеЗаполнено(Текущий) Или Цепочка.Найти(Текущий) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Цепочка.Добавить(Текущий);
		
		Для Каждого ИмяРеквизита Из Реквизиты Цикл
			// У документа реквизита может не быть — это нормально, идём дальше.
			Попытка
				Значение = Текущий[ИмяРеквизита];
			Исключение
				Продолжить;
			КонецПопытки;
			Если ЗначениеЗаполнено(Значение) И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
				Очередь.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Цепочка;
	
КонецФункции

// Тема ответа: «Re: » и тема исходного письма без накопившихся префиксов.
// Тему менять нельзя — Gmail склеивает ветку только при совпадающей теме.
//
Функция ТемаОтвета(Письмо) Экспорт
	
	Возврат "Re: " + СокрЛП(УправлениеЭлектроннойПочтой.ИсключитьПрефиксыТемыПисьма(Строка(Письмо.Тема)));
	
КонецФункции

// Адреса электронной почты контрагента, пригодные для отправки.
//
// Читаются записи всех видов КИ типа "Адрес электронной почты": в этой базе
// почта поставщиков лежит в основном не в виде "E-mail", а в виде "для обмена
// электронными документами", поэтому отбор идёт по типу, а не по виду.
// В Представление регулярно попадает мусор ("-", "www", лишние символы),
// поэтому каждое значение проверяется и чистится.
//
// Параметры
//  Контрагент - СправочникСсылка.Контрагенты
//
// Возвращаемое значение:
//  СписокЗначений - значение адрес, представление наименование контрагента
//
Функция АдресаКонтрагента(Контрагент) Экспорт
	
	Адреса = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Адреса;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Контрагент);
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначениеПоУмолчанию УБЫВ";
	
	Представление = СокрЛП(Строка(Контрагент));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// В одной записи может оказаться несколько адресов через запятую.
		Значение = СтрЗаменить(Выборка.Представление, ";", ",");
		Значение = СтрЗаменить(Значение, Символы.ПС, ",");
		Значение = СтрЗаменить(Значение, Символы.Таб, ",");
		
		КоличествоЧастей = СтрЧислоВхождений(Значение, ",") + 1;
		Для Сч = 1 По КоличествоЧастей Цикл
			
			Адрес = ОчиститьАдрес(СтрПолучитьСтроку(СтрЗаменить(Значение, ",", Символы.ПС), Сч));
			Если Не АдресКорректен(Адрес) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Адреса.НайтиПоЗначению(Адрес) = Неопределено Тогда
				Адреса.Добавить(Адрес, Представление);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Адреса;
	
КонецФункции

// Убирает из адреса символы, которые в этой базе регулярно попадают
// в Представление вместе с адресом.
//
Функция ОчиститьАдрес(Знач Адрес)
	
	Адрес = СокрЛП(Адрес);
	
	МусорныеСимволы = """'<>()[]" + Символы.ПС + Символы.Таб + Символы.ВК + Символ(182);
	
	Результат = "";
	Для Сч = 1 По СтрДлина(Адрес) Цикл
		Симв = Сред(Адрес, Сч, 1);
		Если Найти(МусорныеСимволы, Симв) = 0 Тогда
			Результат = Результат + Симв;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СокрЛП(Результат);
	
КонецФункции

// Проверка адреса: одна собака, точка после неё, ничего пустого по краям.
//
Функция АдресКорректен(Знач Адрес) Экспорт
	
	Адрес = СокрЛП(Адрес);
	
	Если СтрДлина(Адрес) < 5 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрЧислоВхождений(Адрес, "@") <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПозицияСобаки = Найти(Адрес, "@");
	Имя   = Лев(Адрес, ПозицияСобаки - 1);
	Домен = Сред(Адрес, ПозицияСобаки + 1);
	
	Если ПустаяСтрока(Имя) Или ПустаяСтрока(Домен) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПозицияТочки = Найти(Домен, ".");
	Если ПозицияТочки < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// После последней точки должно остаться не меньше двух символов.
	ОстатокДомена = Домен;
	Пока Найти(ОстатокДомена, ".") > 0 Цикл
		ОстатокДомена = Сред(ОстатокДомена, Найти(ОстатокДомена, ".") + 1);
	КонецЦикла;
	
	Если СтрДлина(ОстатокДомена) < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Найти(Адрес, " ") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Кладёт текст в буфер обмена Windows.
//
// Платформенного способа в режиме совместимости 8.2 нет, поэтому через COM
// htmlfile. Если не получилось — текст показывается в отдельном окне,
// чтобы его можно было скопировать руками.
//
// Возвращаемое значение:
//  Булево - удалось ли положить в буфер
//
Функция ПоместитьВБуферОбмена(Знач Текст) Экспорт
	
	#Если Клиент Тогда
	Попытка
		HTMLОбъект = Новый COMОбъект("htmlfile");
		HTMLОбъект.ParentWindow.ClipboardData.SetData("text", Текст);
		Возврат Истина;
	Исключение
		Сообщить("Не удалось положить текст письма в буфер обмена: " + ОписаниеОшибки()
			+ " Текст открыт в отдельном окне — скопируйте его оттуда.");
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Текст);
		ТекстовыйДокумент.Показать("Текст письма поставщику");
		Возврат Ложь;
	КонецПопытки;
	#Иначе
	Возврат Ложь;
	#КонецЕсли
	
КонецФункции

// Число в вид, привычный для письма: два знака после запятой, без разделителя групп.
//
Функция ЧислоВСтроку(Знач Число)
	
	Возврат СокрЛП(Формат(Число, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧГ=0"));
	
КонецФункции
